

已知西元1024年為甲子年，請設計一支程式，可以接受任一西元年份，輸出對應的天干地支的年別。(利用迴圈)<br>

天干：甲乙丙丁戊己庚辛壬癸<br>
地支：子丑寅卯辰巳午未申酉戌亥<br>
天干地支配對：甲子、乙丑、丙寅….甲戌、乙亥、丙子….<br>

<?php
$sky=["甲","乙","丙","丁","戊","己","庚","辛","壬","癸"];
$land=["子","丑","寅","卯","辰","巳","午","未","申","酉","戌","亥"];
// 餘數% 

$skyland=[];
for ($i=0; $i < 60; $i++) { 
    $skyland= $sky[$i%10] . $land[$i%12];
}


// echo "<pre>";
// print_r($skyland);
// echo "</pre>";

echo "<hr>";
$year=2053;
$staryer=1024;
echo "給定西元年" .$year;
echo "<br>天干地支為";










































?>