<h1>論年判斷</h1>
<ul>
    <li>公元年份除以4不可整除，為平年。</li>
    <li>公元年份除以4可整除但除以100不可整除，為閏年。</li>
    <li>公元年份除以100可整除但除以400不可整除，為平年。</li>
</ul>
<p>轉換描述為:</p>
<ul>
    <li>公元年份除以4可整除，為閏年。</li>
    <li>公元年份除以4可整除但除以100不可整除，為閏年。</li>
    <li>公元年份除以100可整除但除以400不可整除，為平年。</li>
</ul>

<?php

















// for($a=0 ; $a<5; $a**){
//     for($b=0 ; $b<$a; $b++){
//         echo '*';
//         echo "<br>";
//     }
// }
echo "<hr>";

$n=10;
for($c=0 ; $c<=$n;$c++){
    for ($i=0; $i<=$c; $i++) { 
    echo "*";
    }
    echo "<br>";
};
echo "<hr>";
// for ($a=1;$a<20 ; $a=$a--) { 
//     echo "*";
//     echo "<br>";
//     for()
//     echo "*";  

// }



 ?>